In [ ]:
import pandas as pd

In [ ]:
movies = pd.read_csv(r'my movies.csv')

In [ ]:
movies

# longest movie

In [ ]:
movies['DURATION'].argmax()

In [ ]:
movies['NAME']

In [ ]:
movies['NAME'][movies['DURATION'].argmax()]

# no. of movies get 10 star rating

In [ ]:
movies['RATING']==10

In [ ]:
movies['NAME'][movies['RATING']==10]

In [ ]:
movies['NAME'][movies['RATING']==10].values[0:2]

In [ ]:
## sum(movies['RATING']==10)

# no. of industries

In [ ]:
movies['INDUSTRY'].value_counts()

In [ ]:
movies['INDUSTRY'].value_counts().count()

In [ ]:
len(movies['INDUSTRY'].value_counts())

# least liked comedy movie

In [ ]:
movies['RATING'][movies['GENRE']=='comedy'].idxmin()

In [ ]:
movies['NAME'][movies['RATING'][movies['GENRE']=='comedy'].idxmin()]

In [ ]:
movies['NAME'][movies['RATING'][movies['GENRE']=='comedy'].min()]

In [ ]:
[movies['RATING'][movies['GENRE']=='comedy'].min()]

In [ ]:
movies.columns

# longest english movie

In [ ]:
movies['NAME'][movies[movies['LANGUAGE']=='english']['DURATION'].idxmax()]

# gener of intersteller

In [ ]:
movies['GENRE'][movies['NAME']=='intersteller']

>this outcome is series type if we want a string

In [ ]:
movies['GENRE'][movies['NAME']=='intersteller'].values[0]

# [

In [ ]:
movies['NAME'].str.lower()

In [ ]:
movies['GENRE'][movies['NAME'].str.lower()=='iNterSteller'.lower()].values[0]

In [ ]:
names=movies['NAME']

In [ ]:
names

In [ ]:
names.to_list()

In [ ]:
names.str.capitalize()

In [ ]:
names.str.casefold()

In [ ]:
names.str.find('e')

In [ ]:
names.str.count('g')

In [ ]:
names.str.get(2)

In [ ]:
names.str.get_dummies()

In [ ]:
movies['GENRE'].str.get_dummies()

In [ ]:
names.str.index('a')

In [ ]:
names.str.split('e')

In [ ]:
names.str.split('e').str.join('--,--')

#to remove spaces

In [ ]:
names.str.strip()

# ]

# Average of each genre

In [ ]:
movies['GENRE'].unique()

In [ ]:
movies['GENRE'].nunique()

In [ ]:
for genre in movies['GENRE'].unique():
    print(genre, movies[movies['GENRE']==genre]['DURATION'].mean())

In [ ]:
movies.groupby('GENRE')['DURATION'].mean()

In [ ]:
movies.groupby(['GENRE','INDUSTRY'])['DURATION'].mean()

In [ ]:
movies.groupby(['INDUSTRY','GENRE'])['DURATION'].mean()

In [ ]:
movies.describe()

In [ ]:
# movies.drop(['I.D.'], axis=1, inplace=True)

In [ ]:
movies=pd.read_csv(r'my movies.csv',index_col=0)

In [ ]:
movies

In [ ]:
movies.describe(include='all')

In [ ]:
movies.groupby('INDUSTRY').describe().T

In [ ]:
movies.groupby(['INDUSTRY','GENRE']).describe().T

# evrage rating of each industry

In [ ]:
movies.groupby('INDUSTRY')['RATING'].mean()

# average reating of romance movies industries wise

In [35]:
movies[movies['GENRE'].str.lower()=='romance'].groupby('INDUSTRY')['RATING'].mean()

INDUSTRY
bollywood     5.0
hollywood    10.0
Name: RATING, dtype: float64

# all the english movies with their respective rating in decending order.

In [36]:
movies[movies['LANGUAGE'].str.lower()=='english'][['NAME','RATING']]

                     NAME  RATING
4   Avengers the and game     9.0
5                  tanent     8.5
7            intersteller     7.0
8                 gravity     8.0
9                 titanic     9.0
11              housefull     6.0

In [38]:
movies[movies['LANGUAGE'].str.lower()=='english'][['NAME','RATING']].sort_values(by='RATING',ascending=False)

                     NAME  RATING
4   Avengers the and game     9.0
9                 titanic     9.0
5                  tanent     8.5
8                 gravity     8.0
7            intersteller     7.0
11              housefull     6.0

1. pivot table
2. panda concat
3. pandas merge
4. pandas joint

In [40]:
data = {'country':['india','china','usa','japan','india','usa'],
       'year':['2010','2010','2010','2015','2015','2015'],
       'continent':['asia','asia','na','asia','asia','na'],
       'values':[20,30,40,20,30,10]}

In [41]:
df=pd.DataFrame(data)

In [42]:
df

  country  year continent  values
0   india  2010      asia      20
1   china  2010      asia      30
2     usa  2010        na      40
3   japan  2015      asia      20
4   india  2015      asia      30
5     usa  2015        na      10

In [43]:
pd.pivot_table(df,index = ['year'],aggfunc='sum')

      values
year
2010      90
2015      60

In [44]:
pd.pivot_table(df,index = ['continent'],aggfunc='sum')

           values
continent
asia          100
na             50

# Concat

In [50]:
people = {'id':[1,2,3,4],
        'name':['as','er','qw','ty'],
        'age':[34,12,22,20]}
people1 = {'id':[12,23,34,45],
        'name':['ase','ere','qwe','tye'],
        'age':[45,13,24,57]}
people2 = {'id':[14,25,36,47],
        'name':['astt','ertt','qwtt','tyyy'],
        'age':[14,12,12,10]}

In [53]:
df1=pd.DataFrame(people)
df2=pd.DataFrame(people1)
df3=pd.DataFrame(people2)

In [54]:
df1

   id name  age
0   1   as   34
1   2   er   12
2   3   qw   22
3   4   ty   20

In [55]:
df2

   id name  age
0  12  ase   45
1  23  ere   13
2  34  qwe   24
3  45  tye   57

In [56]:
df3

   id  name  age
0  14  astt   14
1  25  ertt   12
2  36  qwtt   12
3  47  tyyy   10

In [57]:
pd.concat([df1,df2,df3])

   id  name  age
0   1    as   34
1   2    er   12
2   3    qw   22
3   4    ty   20
0  12   ase   45
1  23   ere   13
2  34   qwe   24
3  45   tye   57
0  14  astt   14
1  25  ertt   12
2  36  qwtt   12
3  47  tyyy   10

In [58]:
pd.concat([df1,df2,df3],ignore_index=True)

    id  name  age
0    1    as   34
1    2    er   12
2    3    qw   22
3    4    ty   20
4   12   ase   45
5   23   ere   13
6   34   qwe   24
7   45   tye   57
8   14  astt   14
9   25  ertt   12
10  36  qwtt   12
11  47  tyyy   10

In [60]:
pd.concat([df1,df2,df3],axis=1)

   id name  age  id name  age  id  name  age
0   1   as   34  12  ase   45  14  astt   14
1   2   er   12  23  ere   13  25  ertt   12
2   3   qw   22  34  qwe   24  36  qwtt   12
3   4   ty   20  45  tye   57  47  tyyy   10

In [67]:
people4 = {'id':[1,2,3,4],
        'name':['as','er','qw','ty'],
        'age':[34,12,22,20]}
people5 = {'id':[1,2,3,4],
        'name':['as','er','qw','ty'],
        'sales':[45,13,24,57]}

In [68]:
df4=pd.DataFrame(people4)
df5=pd.DataFrame(people5)

In [69]:
pd.merge(df4,df5,on=['id','name'])

   id name  age  sales
0   1   as   34     45
1   2   er   12     13
2   3   qw   22     24
3   4   ty   20     57

In [74]:
people6 = {'id':[1,2,3,4],
        'name':['as','er','qw','ty'],
        'age':[34,12,22,20]}
people7 = {
        'name2':['a','e','q','t'],
        'sales':[45555,13333,24444,57777]}

In [75]:
df6=pd.DataFrame(people6)
df7=pd.DataFrame(people7)

In [76]:
df6.join(df7)

   id name  age name2  sales
0   1   as   34     a  45555
1   2   er   12     e  13333
2   3   qw   22     q  24444
3   4   ty   20     t  57777

In [79]:
d1=pd.read_csv('file3.txt',sep='\\t')
d1

C:\Users\hp\AppData\Local\Temp\ipykernel_16552\3018614469.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  d1=pd.read_csv('file3.txt',sep='\\t')

    name;age;roll
0  'akash';22;321
1   'riya';23;121
2   'shub';21;345
3   'rags';22;332
4  'disha';22;312

# creating a json file

In [80]:
df6

   id name  age
0   1   as   34
1   2   er   12
2   3   qw   22
3   4   ty   20

In [81]:
df6.to_json('my json.json')

In [82]:
df=pd.read_json('my json.json')
df

   id name  age
0   1   as   34
1   2   er   12
2   3   qw   22
3   4   ty   20

In [83]:
df5

  name  sales
0    a  45555
1    e  13333
2    q  24444
3    t  57777

In [89]:
df5.to_csv('mycsvv.csv')